#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
aws_dynamodb_table.lockState: Refreshing state... [id=terraform-state-locking]
module.authentication.aws_key_pair.PKIKeyPair: Refreshing state... [id=MicrosoftPKIKeyPair]
aws_iam_user.petrolifero: Refreshing state... [id=petrolifero]
module.authentication.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:sa-east-1:043342988000:certificate/2d1d5fd6-3dc6-4e45-ad78-2f2bbab6cf30]
module.authentication.aws_vpc.ldap: Refreshing state... [id=vpc-04c22c5ff09fcce8f]
module.authentication.aws_iam_user.HR: Refreshing state... [id=HR]
aws_s3_bucket.state: Refreshing state... [id=terraform-state-infra-repository]
module.CI.aws_vpc.jenkins: Refreshing state... [id=vpc-075e3f84bfc1564b5]
module.CI.aws_subnet.guiJenkins: Refreshing state... [id=subnet-0bab71f73174cdc1d]
module.CI.aws_subnet.buildersJenkins: Refreshing state... [id=subnet-0aa6caa0b14483343]
module.authentication.aws_route_table.ldapPublicRouteTable: Refreshing state... [id=rtb-0a6dcc3228e41b9f0]
module.authentication.aws_subnet.PKIRoot: Refreshing state... [id=subnet-0ae2bc7a93a97017c]
module.authentication.aws_subnet.ldap2: Refreshing state... [id=subnet-0a8940f06429d81fb]
module.authentication.aws_internet_gateway.accessToLDAPPKI: Refreshing state... [id=igw-071c3805cdbd6b40a]
module.authentication.aws_subnet.ldap1: Refreshing state... [id=subnet-0d01be6588beb0b03]
module.authentication.aws_directory_service_directory.ldap: Refreshing state... [id=d-94673ca8f2]
module.authentication.aws_network_acl.ldapPublicACL: Refreshing state... [id=acl-01a1a9cd091dc6aaa]
module.authentication.aws_instance.microsoftPKIRoot: Refreshing state... [id=i-09caa53f36fc4abc9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.authentication.aws_route.ldapInternetRoute will be created
  + resource "aws_route" "ldapInternetRoute" {
      + destination_cidr_block = "10.1.3.0/24"
      + gateway_id             = "igw-071c3805cdbd6b40a"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0a6dcc3228e41b9f0"
      + state                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @petrolifero, Action: `pull_request`*